Reports/ВаловаяПрибыльПоПоставщикамТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВаловаяПрибыльПоПоставщикамТОХ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХранения</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВаловаяПрибыльПоПоставщикамТОХ/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Проект КАК Проект,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Покупатель КАК Покупатель,
	|	ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Проект) КАК ПроектПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Покупатель) КАК ПокупательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДоговорПокупателя) КАК ДоговорПокупателяПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС КАК НДС,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль КАК ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность КАК Эффективность,
	|	ВложенныйЗапрос.Рентабельность КАК Рентабельность
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоБазовыхЕдиниц,
	|	СтоимостьБезНДС,
	|	НДС,
	|	Стоимость,
	|	Себестоимость,
	|	ВаловаяПрибыль,
	|	Эффективность,
	|	Рентабельность}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Проект КАК Проект,
	|		ВложенныйЗапрос.Подразделение КАК Подразделение,
	|		ВложенныйЗапрос.Покупатель КАК Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.Период КАК Период,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА) КАК ПериодДекада,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК ПериодМесяц,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ) КАК ПериодКвартал,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД) КАК ПериодГод,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(ВложенныйЗапрос.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|				ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ) КАК СтоимостьБезНДС,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.НДС
	|				ИНАЧЕ ВложенныйЗапрос.НДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ) КАК НДС,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.Стоимость
	|				ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость,
	|		ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА СУММА(ВЫБОР
	|							КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|								ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|							ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|						КОНЕЦ)
	|			ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|							ТОГДА ВложенныйЗапрос.Стоимость
	|						ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|					КОНЕЦ)
	|		КОНЕЦ - СУММА(ВложенныйЗапрос.Себестоимость) КАК ВаловаяПрибыль,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВложенныйЗапрос.Себестоимость) > 0
	|							ТОГДА (СУММА(ВЫБОР
	|										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|									КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Себестоимость) > 0
	|						ТОГДА (СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.Стоимость
	|									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Эффективность,
	|		100 * ВЫБОР
	|			КОГДА &НеВключатьНДСВСтоимостьПартий
	|				ТОГДА ВЫБОР
	|						КОГДА СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|									ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ) > 0
	|							ТОГДА (СУММА(ВЫБОР
	|										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|									КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВЫБОР
	|										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	|										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|									КОНЕЦ)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СУММА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|									ТОГДА ВложенныйЗапрос.Стоимость
	|								ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|							КОНЕЦ) > 0
	|						ТОГДА (СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.Стоимость
	|									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВЫБОР
	|									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|										ТОГДА ВложенныйЗапрос.Стоимость
	|									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|								КОНЕЦ)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК Рентабельность
	|	{ВЫБРАТЬ
	|		Организация,
	|		Проект,
	|		Подразделение,
	|		Покупатель,
	|		ДоговорПокупателя,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Регистратор,
	|		Период,
	|		ПериодДень,
	|		ПериодНеделя,
	|		ПериодДекада,
	|		ПериодМесяц,
	|		ПериодКвартал,
	|		ПериодПолугодие,
	|		ПериодГод}
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОбороты.Организация КАК Организация,
	|			ПродажиОбороты.Проект КАК Проект,
	|			ПродажиОбороты.Подразделение КАК Подразделение,
	|			ПродажиОбороты.Контрагент КАК Покупатель,
	|			ПродажиОбороты.ДоговорКонтрагента КАК ДоговорПокупателя,
	|			ПродажиОбороты.Номенклатура КАК Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.Регистратор КАК Регистратор,
	|			ПродажиОбороты.Период КАК Период,
	|			ПродажиОбороты.КоличествоОборот КАК КоличествоПродажи,
	|			ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) КАК Количество,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕдиниц,
	|			ВЫБОР
	|				КОГДА ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот
	|			КОНЕЦ КАК СтоимостьБезНДС,
	|			ВЫБОР
	|				КОГДА ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиОбороты.НДСОборот
	|			КОНЕЦ КАК НДС,
	|			ВЫБОР
	|				КОГДА ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиОбороты.СтоимостьОборот
	|			КОНЕЦ КАК Стоимость,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ТаблСебестоимость.Себестоимость КАК Себестоимость
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ВложенныйЗапрос.Себестоимость КАК Себестоимость
	|				ИЗ
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|						ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						СУММА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.КоличествоПриходНач = 0
	|									ТОГДА ОКР(ВложенныйЗапрос.СтоимостьПриходНач / 1, 2)
	|								ИНАЧЕ ОКР(ВложенныйЗапрос.СтоимостьПриходНач / ВложенныйЗапрос.КоличествоПриходНач, 2)
	|							КОНЕЦ) КАК Себестоимость
	|					ИЗ
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
	|							КОНЕЦ КАК Номенклатура,
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|							КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|							СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоПриход, 0)) КАК КоличествоПриходНач,
	|							СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьПриход, 0)) КАК СтоимостьПриходНач
	|						ИЗ
	|							РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаНачала, ) КАК ПартииТоваровНаСкладахОстатки
	|								ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ) КАК ПартииТоваровНаСкладахОбороты
	|								ПО ПартииТоваровНаСкладахОстатки.Номенклатура = ПартииТоваровНаСкладахОбороты.Номенклатура
	|									И ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|									И ПартииТоваровНаСкладахОстатки.ДокументОприходования = ПартииТоваровНаСкладахОбороты.ДокументОприходования
	|									И ПартииТоваровНаСкладахОстатки.Заказ = ПартииТоваровНаСкладахОбороты.Заказ
	|									И ПартииТоваровНаСкладахОстатки.Склад = ПартииТоваровНаСкладахОбороты.Склад
	|									И ПартииТоваровНаСкладахОстатки.СерияНоменклатуры = ПартииТоваровНаСкладахОбороты.СерияНоменклатуры
	|									И ПартииТоваровНаСкладахОстатки.СтатусПартии = ПартииТоваровНаСкладахОбороты.СтатусПартии
	|									И ПартииТоваровНаСкладахОстатки.Качество = ПартииТоваровНаСкладахОбороты.Качество
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
	|							КОНЕЦ,
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|							КОНЕЦ) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.Номенклатура,
	|						ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос) КАК ТаблСебестоимость
	|				ПО ПродажиОбороты.Номенклатура = ТаблСебестоимость.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблСебестоимость.ХарактеристикаНоменклатуры
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
	|					ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
	|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
	|					ТоварыОтветственногоХраненияОбороты.КоличествоОборот * -1 КАК КоличествоОборот
	|				ИЗ
	|					РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Контрагент).* КАК Поставщик, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ТоварыОтветственногоХраненияОбороты
	|				ГДЕ
	|					ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
	|				{ГДЕ
	|					ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
	|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}) КАК ТаблТОХ
	|				ПО ПродажиОбороты.Номенклатура = ТаблТОХ.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры
	|					И ПродажиОбороты.Регистратор = ТаблТОХ.Регистратор
	|				ГДЕ
	|					&ТолькоТОХ = ЛОЖЬ
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПродажиОбороты.Организация,
	|			ПродажиОбороты.Проект,
	|			ПродажиОбороты.Подразделение,
	|			ПродажиОбороты.Контрагент,
	|			ПродажиОбороты.ДоговорКонтрагента,
	|			ПродажиОбороты.Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.Регистратор,
	|			ПродажиОбороты.Период,
	|			ПродажиОбороты.КоличествоОборот,
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0),
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1),
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1),
	|			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот,
	|			ПродажиОбороты.НДСОборот,
	|			ПродажиОбороты.СтоимостьОборот,
	|			ЕСТЬNULL(ТаблТОХ.СебестоимостьТОХ, 0)
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВложенныйЗапрос.Регистратор КАК Регистратор,
	|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ВложенныйЗапрос.Контрагент КАК Контрагент,
	|					ВложенныйЗапрос.КоличествоОборот * -1 КАК КоличествоОборот,
	|					ЕСТЬNULL(ЦеныНоменклатурыКонтрагентов.Цена, 0) * ВложенныйЗапрос.КоличествоОборот * -1 КАК СебестоимостьТОХ
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
	|						МАКСИМУМ(ТоварыОтветственногоХраненияОбороты.КоличествоОборот) КАК КоличествоОборот,
	|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен КАК ТипЦен,
	|						МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Период) КАК ПериодЦены
	|					ИЗ
	|						РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Контрагент).* КАК Поставщик, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ТоварыОтветственногоХраненияОбороты
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	|							ПО ТоварыОтветственногоХраненияОбороты.Период >= ЦеныНоменклатурыКонтрагентов.Период
	|								И ТоварыОтветственногоХраненияОбороты.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
	|								И ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен
	|					ГДЕ
	|						ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
	|					{ГДЕ
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен,
	|						ТоварыОтветственногоХраненияОбороты.Регистратор,
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры,
	|						ТоварыОтветственногоХраненияОбороты.Контрагент) КАК ВложенныйЗапрос
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	|						ПО ВложенныйЗапрос.ПериодЦены = ЦеныНоменклатурыКонтрагентов.Период
	|							И ВложенныйЗапрос.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
	|							И ВложенныйЗапрос.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен) КАК ТаблТОХ
	|				ПО ПродажиОбороты.Номенклатура = ТаблТОХ.Номенклатура
	|					И ПродажиОбороты.Регистратор = ТаблТОХ.Регистратор
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Проект,
	|		ВложенныйЗапрос.Подразделение,
	|		ВложенныйЗапрос.Покупатель,
	|		ВложенныйЗапрос.ДоговорПокупателя,
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.Регистратор,
	|		ВложенныйЗапрос.Период
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ВложенныйЗапрос.Количество) <> 0
	|			ИЛИ СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	|			ИЛИ СУММА(ВЫБОР
	|					КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|						ТОГДА ВложенныйЗапрос.Стоимость
	|					ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|				КОНЕЦ) <> 0)) КАК ВложенныйЗапрос
	|{ГДЕ
	|	ВложенныйЗапрос.Регистратор.*,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.КоличествоЕдиницОтчетов,
	|	ВложенныйЗапрос.КоличествоБазовыхЕдиниц,
	|	ВложенныйЗапрос.СтоимостьБезНДС,
	|	ВложенныйЗапрос.НДС,
	|	ВложенныйЗапрос.Стоимость,
	|	ВложенныйЗапрос.Себестоимость,
	|	ВложенныйЗапрос.ВаловаяПрибыль,
	|	ВложенныйЗапрос.Эффективность,
	|	ВложенныйЗапрос.Рентабельность}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоБазовыхЕдиниц,
	|	СтоимостьБезНДС,
	|	НДС,
	|	Стоимость,
	|	Себестоимость,
	|	ВаловаяПрибыль,
	|	Эффективность,
	|	Рентабельность}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоЕдиницОтчетов),
	|	СУММА(КоличествоБазовыхЕдиниц),
	|	СУММА(СтоимостьБезНДС),
	|	СУММА(НДС),
	|	СУММА(Стоимость),
	|	СУММА(Себестоимость),
	|	ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА СУММА(СтоимостьБезНДС)
	|		ИНАЧЕ СУММА(Стоимость)
	|	КОНЕЦ - СУММА(Себестоимость) КАК ВаловаяПрибыль,
	|	100 * ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(Себестоимость) <> 0
	|						ТОГДА (СУММА(СтоимостьБезНДС) - СУММА(Себестоимость)) / СУММА(Себестоимость)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Себестоимость) <> 0
	|					ТОГДА (СУММА(Стоимость) - СУММА(Себестоимость)) / СУММА(Себестоимость)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Эффективность,
	|	100 * ВЫБОР
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(СтоимостьБезНДС) <> 0
	|						ТОГДА (СУММА(СтоимостьБезНДС) - СУММА(Себестоимость)) / СУММА(СтоимостьБезНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(Стоимость) <> 0
	|					ТОГДА (СУММА(Стоимость) - СУММА(Себестоимость)) / СУММА(Стоимость)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Рентабельность
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Организация.*,
	|	Проект.*,
	|	Подразделение.*,
	|	Покупатель.*,
	|	ДоговорПокупателя.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Поставщик", "Поставщик", "Поставщик", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Покупатель", "Покупатель", "Покупатель", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДоговорПокупателя", "ДоговорПокупателя", "Договор покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДокументОприходования", "ДокументОприходования", "Документ оприходования", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	// Покупатель
	// ДоговорКонтрагента
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Проект", "Проект");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Поставщик", "Поставщик");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Покупатель", "Покупатель");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорПокупателя", "Договор покупателя");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", "Номенклатура");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", "Характеристика номенклатуры");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗаказПокупателя", "Заказ покупателя");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументОприходования", "Документ оприходования");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество (ед. хранения)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетов", "Количество (ед. отчетов)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдиниц", "Количество (базовых ед.)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезНДС", "Стоимость продажи без НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДС", "НДС продажи");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость", "Стоимость продажи с НДС");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Себестоимость", "Себестоимость");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВаловаяПрибыль", "Валовая прибыль");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Эффективность", "Эффективность, %");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Рентабельность", "Рентабельность, %");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдиниц", "Базовых ед.", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетов", "Ед. отчетов", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезНДС", "Без НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи", "Стоимость продажи (" + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("НДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", "С НДС", Истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьПродажи");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Себестоимость", "Себестоимость  (" + ВалютаУпр + ")", Ложь, "ЧЦ=15; ЧДЦ=2");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ВаловаяПрибыль", "Валовая прибыль (" + ВалютаУпр + ")", Истина, "ЧЦ=15; ЧДЦ=2");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Эффективность", "Эффективность, %", Ложь, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("Рентабельность", "Рентабельность, %", Истина, "ЧЦ=15; ЧДЦ=2");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Поставщик");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Покупатель");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("Поставщик");
	УниверсальныйОтчет.ДобавитьОтбор("Покупатель");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	Отказ = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(?(Не ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон), ТекущаяДата(), УниверсальныйОтчет.ДатаКон), Отказ);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НеВключатьНДСВСтоимостьПартий", ?(Отказ, Ложь, УчетнаяПолитика.НеВключатьНДСВСтоимостьПартий));
	//+Гавриленков В. 14.08.2025 #
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТолькоТОХ", ?(ВариантОтчета = "Все", Ложь, Истина));
	//-Гавриленков В. 14.08.2025 #
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
